---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentCreatingEventArgs
source: html/43d97649-5199-2706-3855-bdb52cc44b86.htm
---
# Autodesk.Revit.DB.Events.DocumentCreatingEventArgs

The event arguments used by the DocumentCreating event.

## Syntax (C#)
```csharp
public class DocumentCreatingEventArgs : RevitAPIPreEventArgs
```